

#include <iostream>

int main() {
    int N;
    std::cout << "Введите сумму для обналичивания: ";
    std::cin >> N;

    if (N % 100 != 0) {
        std::cout << "Выдать сумму ровно " << N << " рублей невозможно" << std::endl;
        return 0;
    }

    if (N > 150000) {
        std::cout << "Запрашиваемая сумма превышает максимальное значение" << std::endl;
        return 0;
    }

    int k5000 = 0, k2000 = 0, k1000 = 0, k500 = 0, k200 = 0, k100 = 0;

    if (N >= 5000) {
        k5000 = N / 5000;
        N %= 5000;
    }
    if (N >= 2000) {
        k2000 = N / 2000;
        N %= 2000;
    }
    if (N >= 1000) {
        k1000 = N / 1000;
        N %= 1000;
    }
    if (N >= 500) {
        k500 = N / 500;
        N %= 500;
    }
    if (N >= 200) {
        k200 = N / 200;
        N %= 200;
    }
    if (N >= 100) {
        k100 = N / 100;
        N %= 100;
    }

    std::cout << "Для получения суммы ровно " << N << " рублей нужно выдать:" << std::endl;
    std::cout << "5000 рублей: " << k5000 << std::endl;
    std::cout << "2000 рублей: " << k2000 << std::endl;
    std::cout << "1000 рублей: " << k1000 << std::endl;
    std::cout << "500 рублей: " << k500 << std::endl;
    std::cout << "200 рублей: " << k200 << std::endl;
    std::cout << "100 рублей: " << k100 << std::endl;

    return 0;
}
